## mesazon-clusters-dev
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gateway_pg_cluster.data.digitalocean_project.project: Reading...
module.gateway_pg_cluster.data.digitalocean_project.project: Read complete after 1s [id=5d792a15-cf5f-46c7-ab46-425f64c52ea4]
module.gateway_pg_cluster.digitalocean_database_cluster.pg_cluster: Refreshing state... [id=b09c2c35-0a17-44d4-93b8-c3061326f6b7]
module.gateway_pg_cluster.digitalocean_database_db.pg_db: Refreshing state... [id=b09c2c35-0a17-44d4-93b8-c3061326f6b7/database/gateway_db-fra1-dev]
module.gateway_pg_configure.digitalocean_database_user.flyway_user: Refreshing state... [id=b09c2c35-0a17-44d4-93b8-c3061326f6b7/user/gateway_flyway_user_dev]
module.gateway_pg_configure.digitalocean_database_user.database_user: Refreshing state... [id=b09c2c35-0a17-44d4-93b8-c3061326f6b7/user/gateway-dev]
module.gateway_pg_cluster.digitalocean_database_postgresql_config.pg_config: Refreshing state... [id=b09c2c35-0a17-44d4-93b8-c3061326f6b7/postgresql-config]
module.gateway_pg_cluster.digitalocean_database_connection_pool.pg_pool: Refreshing state... [id=b09c2c35-0a17-44d4-93b8-c3061326f6b7/gateway-pool-01-fra1-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gateway_pg_cluster.digitalocean_database_connection_pool.pg_pool must be replaced
-/+ resource "digitalocean_database_connection_pool" "pg_pool" {
      ~ db_name      = "gateway_db-fra1-dev" -> "gateway_db_fra1_dev" # forces replacement
      ~ host         = "gateway-fra1-dev-do-user-26186808-0.l.db.ondigitalocean.com" -> (known after apply)
      ~ id           = "b09c2c35-0a17-44d4-93b8-c3061326f6b7/gateway-pool-01-fra1-dev" -> (known after apply)
        name         = "gateway-pool-01-fra1-dev"
      ~ password     = (sensitive value)
      ~ port         = 25061 -> (known after apply)
      ~ private_host = "private-gateway-fra1-dev-do-user-26186808-0.l.db.ondigitalocean.com" -> (known after apply)
      ~ private_uri  = (sensitive value)
      ~ uri          = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.gateway_pg_cluster.digitalocean_database_db.pg_db must be replaced
-/+ resource "digitalocean_database_db" "pg_db" {
      ~ id         = "b09c2c35-0a17-44d4-93b8-c3061326f6b7/database/gateway_db-fra1-dev" -> (known after apply)
      ~ name       = "gateway_db-fra1-dev" -> "gateway_db_fra1_dev" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.gateway_pg_configure.digitalocean_database_user.database_user must be replaced
-/+ resource "digitalocean_database_user" "database_user" {
      + access_cert = (sensitive value)
      + access_key  = (sensitive value)
      ~ id          = "b09c2c35-0a17-44d4-93b8-c3061326f6b7/user/gateway-dev" -> (known after apply)
      ~ name        = "gateway-dev" -> "gateway_dev" # forces replacement
      ~ password    = (sensitive value)
      ~ role        = "normal" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.gateway_pg_configure.postgresql_default_privileges.flyway_sequences_to_user will be created
  + resource "postgresql_default_privileges" "flyway_sequences_to_user" {
      + database          = "gateway_db_fra1_dev"
      + id                = (known after apply)
      + object_type       = "sequence"
      + owner             = "gateway_flyway_user_dev"
      + privileges        = [
          + "USAGE",
        ]
      + role              = "gateway_group_dev"
      + schema            = "gateway_dev"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_default_privileges.flyway_tables_to_user will be created
  + resource "postgresql_default_privileges" "flyway_tables_to_user" {
      + database          = "gateway_db_fra1_dev"
      + id                = (known after apply)
      + object_type       = "table"
      + owner             = "gateway_flyway_user_dev"
      + privileges        = [
          + "DELETE",
          + "INSERT",
          + "SELECT",
          + "UPDATE",
        ]
      + role              = "gateway_group_dev"
      + schema            = "gateway_dev"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant.flyway_provided_schema_usage will be created
  + resource "postgresql_grant" "flyway_provided_schema_usage" {
      + database          = "gateway_db_fra1_dev"
      + id                = (known after apply)
      + object_type       = "schema"
      + privileges        = [
          + "CREATE",
          + "USAGE",
        ]
      + role              = "gateway_flyway_group_dev"
      + schema            = "gateway_dev"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant.flyway_public_schema_usage will be created
  + resource "postgresql_grant" "flyway_public_schema_usage" {
      + database          = "gateway_db_fra1_dev"
      + id                = (known after apply)
      + object_type       = "schema"
      + privileges        = [
          + "CREATE",
          + "USAGE",
        ]
      + role              = "gateway_flyway_group_dev"
      + schema            = "public"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant.user_provided_schema_usage will be created
  + resource "postgresql_grant" "user_provided_schema_usage" {
      + database          = "gateway_db_fra1_dev"
      + id                = (known after apply)
      + object_type       = "schema"
      + privileges        = [
          + "USAGE",
        ]
      + role              = "gateway_group_dev"
      + schema            = "gateway_dev"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant_role.flyway_assignment will be created
  + resource "postgresql_grant_role" "flyway_assignment" {
      + grant_role        = "gateway_flyway_group_dev"
      + id                = (known after apply)
      + role              = "gateway_flyway_user_dev"
      + with_admin_option = false
    }

  # module.gateway_pg_configure.postgresql_grant_role.user_assignment will be created
  + resource "postgresql_grant_role" "user_assignment" {
      + grant_role        = "gateway_group_dev"
      + id                = (known after apply)
      + role              = "gateway_dev"
      + with_admin_option = false
    }

  # module.gateway_pg_configure.postgresql_role.flyway_group will be created
  + resource "postgresql_role" "flyway_group" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = false
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = false
      + name                      = "gateway_flyway_group_dev"
      + replication               = false
      + skip_drop_role            = false
      + skip_reassign_owned       = false
      + superuser                 = false
      + valid_until               = "infinity"
    }

  # module.gateway_pg_configure.postgresql_role.user_group will be created
  + resource "postgresql_role" "user_group" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = false
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = false
      + name                      = "gateway_group_dev"
      + replication               = false
      + skip_drop_role            = false
      + skip_reassign_owned       = false
      + superuser                 = false
      + valid_until               = "infinity"
    }

  # module.gateway_pg_configure.postgresql_schema.database_schema will be created
  + resource "postgresql_schema" "database_schema" {
      + database      = (known after apply)
      + drop_cascade  = false
      + id            = (known after apply)
      + if_not_exists = true
      + name          = "gateway_dev"
      + owner         = "gateway_group_dev"

      + policy (known after apply)
    }

Plan: 13 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>